GIT - распределенная система контроля версий 
Это система для отслеживания и введения истории изменений ваших файлов или проекта.
Репозиторий - это хранилище ваших файлов, которые вы отслеживаете при помощи гита и изменений.
Команды GIT: 
1. git init - она создает новый гит репозиторий локально на вашем пк, создаст она в той директории, где вы запускаете эту команду.
2. git add - когда мы создаём и изменяем файлы, то при помощи этой команды мы загружаем все изменения в промежуточное место хранения.
gid add <file_name>
git add . -> все в текущей директории
3. git commit - как только мы достигаем определенного момента в разработке, то мы тогда сохраняем и комментируем все наши изменения в репозитории. Т.е. иными словами это фиксация изменений в репо.
git commit -m '<comments>'
.
